Description: This is a recipe template that is used to pull details from a "dev"
  run for a package and perform a "production" run for a particular software title.

  The matched .pkg will be uploaded into Jamf Pro and optionally, a Policy created or updated.
Identifier: com.github.mlbz521.ProductionTemplate
Input: 
  match_pkg: "%MATCH_PKG%"
  recipe_id: "%RECIPE_ID%"
  cache_dir: "%CACHE_DIR%"
Process:
- Processor: PkgBotPromoter
  Arguments:
    custom_variables:
    - CATEGORY
    - CUSTOM_TRIGGER
    - EXCLUSION
    - EXCLUSION2
    - EXCLUSION3
    - SCRIPT_NAME
    - SCRIPT_PARAMETER_1
    - SCRIPT_PARAMETER_2
    - SCRIPT_PARAMETER_3
    - SCRIPT_PARAMETER_4
    - SCRIPT_PARAMETER_5
    - SCRIPT_PARAMETER_6
    - SCRIPT_PARAMETER_7
    - SCRIPT_PARAMETER_8
    - SCRIPT_PRIORITY
    - SELF_SERVICE_DESCRIPTION
    - SELF_SERVICE_DISPLAY_NAME
    match_pkg: '%match_pkg%'
    recipe_id: '%recipe_id%'
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
- Processor: StopProcessingIf
  Arguments:
    predicate: PKG_ONLY == TRUE
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    replace_policy: "True"
  Comment: Self Service install policy
