<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>This is a shell template recipe that is used to pull details from a "dev" run for a package and create a "production" policy for a particular title.</string>
	<key>Identifier</key>
	<string>com.github.mlbz521.jss.ProductionTemplate</string>
	<key>Input</key>
	<dict>
		<key>GROUP_NAME</key>
		<string></string>
		<key>GROUP_TEMPLATE</key>
		<string></string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>recipe_id</key>
				<string>%recipe_id%</string>
				<key>custom_variables</key>
				<array>
					<string>CUSTOM_TRIGGER</string>
					<string>EXCLUSION</string>
					<string>EXCLUSION2</string>
					<string>EXCLUSION3</string>
					<string>SCRIPT_NAME</string>
					<string>SCRIPT_PARAMETER_1</string>
					<string>SCRIPT_PARAMETER_2</string>
					<string>SCRIPT_PARAMETER_3</string>
					<string>SCRIPT_PARAMETER_4</string>
					<string>SCRIPT_PARAMETER_5</string>
					<string>SCRIPT_PARAMETER_6</string>
					<string>SCRIPT_PARAMETER_7</string>
					<string>SCRIPT_PARAMETER_8</string>
					<string>SCRIPT_PRIORITY</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>JSSRecipeReceiptChecker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>prod_name</key>
				<string>%prod_name%</string>
				<key>policy_category</key>
				<string>%CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Comment</key>
			<string>Self Service install policy</string>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>